Merge pull request #19 from lzguan/doc-refactor
Documentation refactor
